from branch_2 import *

if not flag_death_player:
    print('''Подобравшись к Пустынному холму, ты видишь ту самую дварфийку...
    Но она настроена очень враждебно!
    Буг Булюль готовится атаковать!!!''')

    if vul_gul_save == 1:
        persons = [Ksandr, Vul_Gul, Bug_Bulul]
    else:
        persons = [Ksandr, Bug_Bulul]

    tracker_list = tracker_initiative(persons)
    save_bug_bulul = 0
    artifact_3 = {}
    while (all(person[0].hp > 0 for person in tracker_list if
               person[0] != Bug_Bulul) and Bug_Bulul.hp > 0) and save_bug_bulul != 1:
        for person in tracker_list:
            print(f'{'-' * 25}\nХод {person[0].name}!\n{'-' * 25}')
            if person[0] == Ksandr:
                person[0].block_turn(Bug_Bulul)
                flag_save = person[0].analysising(15)
                if person[0].analysising_bug_bulul(flag_save):
                    save_bug_bulul = 1
            elif person[0] == Vul_Gul and save_bug_bulul != 1:
                person[0].block_turn(Bug_Bulul)
            elif person[0] == Bug_Bulul and save_bug_bulul != 1 and vul_gul_save:
                person[0].block_turn(choice([Ksandr, Vul_Gul]))
            elif person[0] == Bug_Bulul and save_bug_bulul != 1 and not vul_gul_save:
                person[0].block_turn(Ksandr)

    if not save_bug_bulul:
        if Ksandr.hp <= 0:
            flag_death_player = 1
            print('===Игра окончена===\n К сожалению, ты погиб, и тебе не удалось спасти мир!...')
        else:
            if vul_gul_save and Vul_Gul.hp > 0 and Bug_Bulul.hp <= 0:
                print('🗡️Вуль гуль: Мамочка.... Почему именно ты попала в его лапы....')
                sleep(5)
                Vul_Gul.hp = Vul_Gul.mx_hp
                print('''🗡️Вуль гуль: ЗА ЧТОООООООООО???!!!
                🛡Ксандр Вин: Послушай, Вуль Гуль, нам надо отправляться. Мне тоже безумно печально, но нужно идти...
                🗡️Вуль гуль: ДА ЧТО ТЫ ЗНАЕШЬ О ПЕЧАЛИ??? У МЕНЯ КРОМЕ НЕЁ БОЛЬШЕ НИКОГО НЕТ!!!
                🗡️Вуль гуль: Оставь меня одну...''')
            elif vul_gul_save and Vul_Gul.hp <= 0 and Bug_Bulul.hp <= 0:
                print('''🛡Ксандр Вин: Ну вот и всё... Ни той, ни другой...''')
                sleep(5)
                print('''🛡Ксандр Вин: Покойтесь с миром, славные и самые храбрые в мире дварфийки, нет! 
                🛡Ксандр Вин: Величайшие Женщины...''')
                vul_gul_save = 0
            elif not vul_gul_save and Bug_Bulul.hp <= 0:
                print('🛡Ксандр Вин: Эхх... Буг Булюль... Прости меня за всё... Пожалуйста!..')
    else:
        if vul_gul_save:
            if Vul_Gul.hp <= 0:
                Bug_Bulul.hp = Bug_Bulul.mx_hp
                Bug_Bulul.mp = Bug_Bulul.mx_mp
                print('''🎸Буг Булюль: ВАЙЙЙЯЯЯ, ТОЛЬКО НЕ ЭТООО!!!!!
                🎸Буг Булюль: ВУУУУУЛЬ ГУУУУЛЬ!!!!!
                🎸Буг Булюль: Как же так, солнышко, извини меня, прости мать старую, глупую, вай вай вай....
                🎸Буг Булюль: ...
                🎸Буг Булюль: ТЕПЕРЬ Я ЕГО ТОЧНО УБЬЮ!
                🛡Ксандр Вин: Согласен, никто не в праве так решать судьбы детей!''')
                vul_gul_save = 0
            else:
                Vul_Gul.hp = Vul_Gul.mx_hp
                Bug_Bulul.hp = Bug_Bulul.mx_hp
                Bug_Bulul.mp = Bug_Bulul.mx_mp
                print('''🎸Буг Булюль: ВАЙЙЙЯЯЯ, ВУЛЬ ГУУУУЛЬ!!!!!
                🗡️Вуль гуль: МАМММАААА, ЙОШКИН КОООТ, ТЫ ВЕРНУЛАААСЬ!!!
                🗡️Вуль гуль: УРРРАА Я ТАК РАДААА!!!
                🎸Буг Булюль: ВАААЙ, А Я ТО КАК, ДОЧКА!!!
                🗡️Вуль гуль, 🎸Буг Булюль: Ксандр, спасибо тебе большое нереальное!
                🛡Ксандр Вин: Да ладно, я сам рад, что мы все живы)''')
        else:
            Bug_Bulul.hp = Bug_Bulul.mx_hp
            Bug_Bulul.mp = Bug_Bulul.mx_mp
            print('''🎸Буг Булюль: ВАЙЙЙЯЯЯ, КСАНДР, МИЛЕНЬКИЙ, СПАСИБО ТЕБЕ БОЛЬШОЕ!!!
            🎸Буг Булюль: Я так рада, что теперь вай не работаю с этим Сайрексом!
            🛡Ксандр Вин: Я тоже рад, что всё обошлось!''')

    artifact_3[
        'Кулон \Последняя Надежда/'] = 'Когда ты им воспользуешься, все, кто находится в радиусе 10 км, бесследно испаряются'
    print(
        f'АРТЕФАКТ НАЙДЕН! Серьги \Последняя Надежда/ - Когда ты им воспользуешься, все, кто находится в радиусе 10 км, бесследно испаряются')

print('''🛡Ксандр Вин: Что ж, пора отправляться в последний путь... Эпицентр Элементалии...''')
Ksandr.hp = Ksandr.mx_hp

import branch_4